slides/aula03/aula03.org
#+OPTIONS: num:nil toc:nil
#+OPTIONS: date:nil reveal_mathjax:t
#+OPTIONS: tex t
#+OPTIONS: timestamp:nil
#+OPTIONS: org-confirm-babel-evaluate nil
#+REVEAL_THEME: white
#+REVEAL_HLEVEL: 1
#+REVEAL_ROOT: file:../reveal.js

#+Title: Análise sintática
#+Author: Construção de compiladores I

* Objetivos

** Objetivos

- Apresentar a importância da etapa de análise sintática.

- Revisar conceitos de gramáticas e linguagens livres de contexto

** Objetivos

- Apresentar como representar programas como árvores de sintaxe.
  - Como árvores de sintaxe podem ser codificadas como tipos em Haskell.

- Apresentar a técnica de análise sintática descendente recursiva.

* Análise sintática

** Análise sintática

- Responsável por determinar se o programa atende as restrições sintáticas
  da linguagem.

** Análise sintática

- Regras sintáticas de uma linguagem são expressas utilizando gramáticas livres de contexto.

** Análise sintática

- Porque utilizar GLCs e não ERs?
  - ERs não são capazes de representar construções simples de linguagens.

** Análise sintática

- Vamos considerar um fragmento de expressões formado por variáveis, constantes inteiras
  adição, multiplicação.

** Análise sintática

- A seguinte ER representa essa linguagem:

\begin{array}{c}
base = [a..z]([a..z] | [0..9])^* \\
base((+|*)base)^*
\end{array}

** Análise sintática

- A ER anterior aceita palavras como $a * b + c$.

- Porém, como determinar a precedência entre operadores?

** Análise sintática

- Podemos usar a precedência usual da aritmética.

- Porém, não é possível impor uma ordem diferente de avaliação.
  - Para isso, precisamos de parêntesis.

** Análise sintática

- Ao incluir parêntesis, temos um problema:
  - Como expressar usando ER que parêntesis estão corretos?

** Análise sintática

- Pode-se provar que a linguagem de parêntesis balanceados não é regular.
  - Usando o lema do bombeamento.
  - Estrutura similar a $\{0^n1^n\,|\,n\geq 0\}$.

** Análise sintática

- Dessa forma, precisamos utilizar GLCs para representar a estrutura sintática
  de linguagens.

** Análise sintática

- Antes de apresentar técnicas de análise sintática, vamos revisar alguns
  conceitos sobre GLCs.

* Gramáticas Livres de Contexto

** Gramáticas livres de contexto

- Uma GLC é $G=(V,\Sigma,R,P)$, em que
  - $V$: conjunto de variáveis (não terminais)
  - $\Sigma$: alfabeto (terminais)
  - $R \subseteq V\times (V\cup\Sigma)^*$: regras (produções).
  - $P\in V$: variável de partida.

** Gramáticas livres de contexto

- Gramática de expressões

\begin{array}{lcl}
E & \to & (E) \,|\, E + E \,|\, E * E\,|\, num\,|\,var\\
\end{array}

** Gramáticas livres de contexto

- $V = \{E\}$
- $\Sigma = \{num, var, (, ), *, +\}$
- $R$: conjunto de regras da gramática.

** Gramáticas livres de contexto

- Determinamos se uma palavra pertence ou não à linguagem
  de uma gramática construindo uma *derivação*

** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow &
\end{array}


** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   \\
\end{array}



** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
\end{array}


** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E \\
\end{array}


** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E\\
\end{array}


** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E & \Rightarrow & \textbf{regra } E \to num\\
\end{array}


** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E & \Rightarrow & \textbf{regra } E \to num\\
num + num * E \\
\end{array}


** Gramáticas livres de contexto

- Exemplo: Derivação de $num + num * num$.

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E & \Rightarrow & \textbf{regra } E \to num\\
num + num * E & \Rightarrow & \textbf{regra } E \to num \\
num + num * num
\end{array}

** Gramáticas livres de contexto

- O exemplo anterior foi de uma *derivação mais à esquerda*
  - Expande-se o não terminal mais a esquerda.

** Gramáticas livres de contexto

- Note que essa gramática de expressões permite:

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E * E\\
E * E   \\
\end{array}

** Gramáticas livres de contexto

- Com isso temos *duas* derivações distintas para a mesma palavra.

- Isso torna a gramática de exemplo *ambígua*.

** Gramáticas livres de contexto

- Em algumas situações é necessário modificar regras de uma gramática para usar certas técnicas de análise sintática.

- Veremos algumas dessas técnicas.

* Transformações de gramáticas

** Transformações de gramáticas

- Fatoração à esquerda: Evitar mais de uma regra com o mesmo prefixo

** Transformações de gramáticas

- Exemplo:

\begin{array}{lcl}
  A & \to & xz \,|\, xy\,|\,v
\end{array}

- pode ser transformada em:

\begin{array}{lcl}
  A & \to & xZ\,|\,v\\
  Z & \to & z \,|\,y
\end{array}

** Transformações de gramáticas

- Introdução de prioridades.
  - Problema comum em linguagens de programação com operadores.
  - Impor ordem de precedência na ausência de parêntesis.

** Transformações de gramáticas

- Forma geral para introduzir prioridades:
  - $E_i$: expressões com precedência de nível $i$.
  - Maior precedência: mais profundo.

\begin{array}{lcl}
E_i & \to & E_{i + 1} \,|\, E_i Op_i E_{i + 1}
\end{array}

