slides/aula03/aula03.tex
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Construção de compiladores I}
\date{}
\title{Análise sintática}
\hypersetup{
 pdfauthor={Construção de compiladores I},
 pdftitle={Análise sintática},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.22)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Objetivos}
\label{sec:orgd6645e3}

\subsection*{Objetivos}
\label{sec:orge93a2d9}

\begin{itemize}
\item Apresentar a importância da etapa de análise sintática.

\item Revisar conceitos de gramáticas e linguagens livres de contexto
\end{itemize}
\subsection*{Objetivos}
\label{sec:orgcfe0114}

\begin{itemize}
\item Apresentar como representar programas como árvores de sintaxe.
\begin{itemize}
\item Como árvores de sintaxe podem ser codificadas como tipos em Haskell.
\end{itemize}

\item Apresentar a técnica de análise sintática descendente recursiva.
\end{itemize}
\section*{Análise sintática}
\label{sec:org4659ab1}

\subsection*{Análise sintática}
\label{sec:orge4886c1}

\begin{itemize}
\item Responsável por determinar se o programa atende as restrições sintáticas
da linguagem.
\end{itemize}
\subsection*{Análise sintática}
\label{sec:orgea636fd}

\begin{itemize}
\item Regras sintáticas de uma linguagem são expressas utilizando gramáticas livres de contexto.
\end{itemize}
\subsection*{Análise sintática}
\label{sec:orgcfa554c}

\begin{itemize}
\item Porque utilizar GLCs e não ERs?
\begin{itemize}
\item ERs não são capazes de representar construções simples de linguagens.
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org9df55a4}

\begin{itemize}
\item Vamos considerar um fragmento de expressões formado por variáveis, constantes inteiras
adição, multiplicação.
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org9d602ef}

\begin{itemize}
\item A seguinte ER representa essa linguagem:
\end{itemize}

\begin{array}{c}
base = [a..z]([a..z] | [0..9])^* \\
base((+|*)base)^*
\end{array}
\subsection*{Análise sintática}
\label{sec:orgf4bc234}

\begin{itemize}
\item A ER anterior aceita palavras como \(a * b + c\).

\item Porém, como determinar a precedência entre operadores?
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org5edb33d}

\begin{itemize}
\item Podemos usar a precedência usual da aritmética.

\item Porém, não é possível impor uma ordem diferente de avaliação.
\begin{itemize}
\item Para isso, precisamos de parêntesis.
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org7bc8dff}

\begin{itemize}
\item Ao incluir parêntesis, temos um problema:
\begin{itemize}
\item Como expressar usando ER que parêntesis estão corretos?
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org874f3f8}

\begin{itemize}
\item Pode-se provar que a linguagem de parêntesis balanceados não é regular.
\begin{itemize}
\item Usando o lema do bombeamento.
\item Estrutura similar a \(\{0^n1^n\,|\,n\geq 0\}\).
\end{itemize}
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org2557bdd}

\begin{itemize}
\item Dessa forma, precisamos utilizar GLCs para representar a estrutura sintática
de linguagens.
\end{itemize}
\subsection*{Análise sintática}
\label{sec:org8de8b58}

\begin{itemize}
\item Antes de apresentar técnicas de análise sintática, vamos revisar alguns
conceitos sobre GLCs.
\end{itemize}
\section*{Gramáticas Livres de Contexto}
\label{sec:org56fb0b2}

\subsection*{Gramáticas livres de contexto}
\label{sec:org70e583b}

\begin{itemize}
\item Uma GLC é \(G=(V,\Sigma,R,P)\), em que
\begin{itemize}
\item \(V\): conjunto de variáveis (não terminais)
\item \(\Sigma\): alfabeto (terminais)
\item \(R \subseteq V\times (V\cup\Sigma)^*\): regras (produções).
\item \(P\in V\): variável de partida.
\end{itemize}
\end{itemize}
\subsection*{Gramáticas livres de contexto}
\label{sec:org30c339f}

\begin{itemize}
\item Gramática de expressões
\end{itemize}

\begin{array}{lcl}
E & \to & (E) \,|\, E + E \,|\, E * E\,|\, num\,|\,var\\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:orgefc57f9}

\begin{itemize}
\item \(V = \{E\}\)
\item \(\Sigma = \{num, var, (, ), *, +\}\)
\item \(R\): conjunto de regras da gramática.
\end{itemize}
\subsection*{Gramáticas livres de contexto}
\label{sec:org8852942}

\begin{itemize}
\item Determinamos se uma palavra pertence ou não à linguagem
de uma gramática construindo uma \textbf{derivação}
\end{itemize}
\subsection*{Gramáticas livres de contexto}
\label{sec:org0faaff3}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow &
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org70f020f}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   \\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org30f5816}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org5243b11}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E \\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:orge81636a}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E\\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org30acd2f}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E & \Rightarrow & \textbf{regra } E \to num\\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org162e271}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E & \Rightarrow & \textbf{regra } E \to num\\
num + num * E \\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org54436f6}

\begin{itemize}
\item Exemplo: Derivação de \(num + num * num\).
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E + E\\
E + E   & \Rightarrow & \textbf{regra } E \to num\\
num + E & \Rightarrow & \textbf{regra } E \to E * E\\
num + E * E & \Rightarrow & \textbf{regra } E \to num\\
num + num * E & \Rightarrow & \textbf{regra } E \to num \\
num + num * num
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org0e823fa}

\begin{itemize}
\item O exemplo anterior foi de uma \textbf{derivação mais à esquerda}
\begin{itemize}
\item Expande-se o não terminal mais a esquerda.
\end{itemize}
\end{itemize}
\subsection*{Gramáticas livres de contexto}
\label{sec:orgefe8b3e}

\begin{itemize}
\item Note que essa gramática de expressões permite:
\end{itemize}

\begin{array}{lcl}
E       & \Rightarrow & \textbf{regra } E\to E * E\\
E * E   \\
\end{array}
\subsection*{Gramáticas livres de contexto}
\label{sec:org078113e}

\begin{itemize}
\item Com isso temos \textbf{duas} derivações distintas para a mesma palavra.

\item Isso torna a gramática de exemplo \textbf{ambígua}.
\end{itemize}
\subsection*{Gramáticas livres de contexto}
\label{sec:orgecf2ed3}

\begin{itemize}
\item Em algumas situações é necessário modificar regras de uma gramática para usar certas técnicas de análise sintática.

\item Veremos algumas dessas técnicas.
\end{itemize}
\section*{Transformações de gramáticas}
\label{sec:org6c3b481}

\subsection*{Transformações de gramáticas}
\label{sec:org622a21c}

\begin{itemize}
\item Fatoração à esquerda: Evitar mais de uma regra com o mesmo prefixo
\end{itemize}
\subsection*{Transformações de gramáticas}
\label{sec:org44e9e26}

\begin{itemize}
\item Exemplo:
\end{itemize}

\begin{array}{lcl}
  A & \to & xz \,|\, xy\,|\,v
\end{array}

\begin{itemize}
\item pode ser transformada em:
\end{itemize}

\begin{array}{lcl}
  A & \to & xZ\,|\,v\\
  Z & \to & z \,|\,y
\end{array}
\subsection*{Transformações de gramáticas}
\label{sec:org6eea7a3}

\begin{itemize}
\item Introdução de prioridades.
\begin{itemize}
\item Problema comum em linguagens de programação com operadores.
\item Impor ordem de precedência na ausência de parêntesis.
\end{itemize}
\end{itemize}
\subsection*{Transformações de gramáticas}
\label{sec:org6ba1bfe}

\begin{itemize}
\item Forma geral para introduzir prioridades:
\begin{itemize}
\item \(E_i\): expressões com precedência de nível \(i\).
\item Maior precedência: mais profundo.
\end{itemize}
\end{itemize}

\begin{array}{lcl}
E_i & \to & E_{i + 1} \,|\, E_i Op_i E_{i + 1}
\end{array}
