slides/aula03/aula03.org
** Transformação de gramáticas

- Exemplo:
  - Multiplicação com predência maior que adição.

\begin{array}{lcl}
E & \to & n \,|\,E + E\,|\,E * E\\
\end{array}

** Transformação de gramáticas

- Exemplo

\begin{array}{lcl}
E_1 & \to & E_1 + E_2\,|\,E_2 \\
E_2 & \to & E_2 * E_3\,|\,E_3 \\
E_3 & \to & n\\
\end{array}

** Transformações de gramáticas

- Eliminar recursão à esquerda
  - Transformar em recursão à direita.

\begin{array}{lcl}
A & \to & Ay_1\,|\,...\,|\,Ay_n\,|\,w_1\,|\,...\,|\,w_k\\
\end{array}

** Transformações de gramáticas

- Pode ser transformada em

\begin{array}{lcl}
A & \to & w_1Z\,|\,...\,|\,w_kZ\,|\,w_1\,...\,|\,w_k\\
Z & \to & y_1Z\,|\,...\,|\,y_nZ\,|\,y_1\,...\,|\,y_n\\
\end{array}

** Transformação de gramáticas

- Eliminar recursão a esquerda.
  - Resolução no quadro

\begin{array}{lcl}
   S & \to & Aa\,|\,b\\
   A & \to & Ac\,|\,Sd\,|\,\lambda\\
\end{array}

* Árvores de sintaxe

** Árvores de sintaxe

- Em teoria de linguagens, representamos derivações de uma gramática por **árvores de derivação**.

- Uma árvore de sintaxe deve representar a estrutura da derivação de um programa.

** Árvores de sintaxe

- Estratégia para definir árvores de sintaxe
  - Um tipo para cada não terminal da gramática.
  - Cada regra de um não terminal, é um construtor do tipo.

** Árvores de sintaxe

- Qual a estrutura da árvore de sintaxe:

\begin{array}{lcl}
E & \to & num \,|\,var\,|\,(E)\,|\,E+E\,|\,E * E\\
\end{array}

** Árvores de sintaxe

- Árvore de sintaxe

#+begin_src haskell
data Exp = Const Int
         | Var String
         | Add Exp Exp
         | Mul Exp Exp
#+end_src

** Árvores de sintaxe

- Porque não uma construção para parêntesis?
  - São usados apenas para determinar precedência
  - A rigor, parêntesis não tem significado após análise sintática.

** Árvores de sintaxe

- O tipo anterior é um exemplo de sintaxe **abstrata**
  - Elimina detalhes irrelevanes para o significado do programa.
- Código escrito do programa usa a sintaxe **concreta**.

** Árvores de sintaxe

- Considere a seguinte gramática:

\begin{array}{lcl}
S & \to & S\:S\:|\:s
\end{array}

** Árvores de sintaxe

- Representando a árvore de sintaxe

#+begin_src haskell
data S = Rule1 S S | Rule2 Char
#+end_src

** Árvores de sintaxe

- Considere a tarefa de produzir a string representada pela árvore

#+begin_src haskell
pprS :: S -> String
pprS (Rule1 s1 s2) = pprS s1 ++ pprS s2
pprS (Rule2 _) = "s"
#+end_src

** Árvores de sintaxe

- Note que o construtor =Rule2 Char= não usa o caracter que armazena
  - Sempre vamos produzir o caractere =s=.

** Árvores de sintaxe

- Podemos refinar a árvore para

#+begin_src haskell
data SA = Rule1 SA SA | Rule2
#+end_src

** Árvores de sintaxe

- Refinando a função de impressão

#+begin_src haskell
pprS :: SA -> String
pprS (Rule1 s1 s2) = pprS s1 ++ pprS s2
pprS Rule2 = "s"
#+end_src

* Análise descendente

** Análise descendente

- Na apresentação do compilador de expressões, implementamos funções simples para um analisador descendente

- Apesar de possuir uma implementação simples:
  - Não é eficiente
  - Não permite uma maneira adequada para lidar com erros de análise sintática.

** Análise descendente

- Vamos utilizar a biblioteca =megaparsec=
  - Permite a construção de analisadores descendentes eficientes.
  - Bom suporte a mensagens de erro.

** Análise descendente

- Excelente documentação disponível on-line:

[[https://markkarpov.com/tutorial/megaparsec.html]]

** Análise descendente

- Vamos apresentar a implementação do parser de expressões usando =megaparsec=

- Exemplo disponível no módulo =Megaparsec.ParserExample= do repositório.

** Análise descendente

- Primeiro passo: definir um tipo para os parsers e erros

#+begin_src haskell
type Parser = Parsec Void String

type ParserError = ParseErrorBundle String Void
#+end_src

** Análise descendente

- Segundo passo: definir um analisador léxico.

#+begin_src haskell
slexer :: Parser ()
slexer = L.space space1
                 (L.skipLineComment "//")
                 (L.skipBlockComment "/*" "*/")
#+end_src

** Análise descendente

- Definindo funções simples.

#+begin_src haskell
symbol :: String -> Parser String
symbol s = L.symbol slexer s
#+end_src

** Análise descendente

- Lidando com parêntesis

#+begin_src haskell
parens :: Parser a -> Parser a
parens = between (symbol "(") (symbol ")")
#+end_src

** Análise descendente

- Adicionando a capacidade de eliminar espaços e comentários em um parser qualquer.

#+begin_src haskell
lexeme :: Parser a -> Parser a
lexeme = L.lexeme slexer
#+end_src

** Análise descendente

- Processando números

#+begin_src haskell
integer :: Parser Int
integer = lexeme L.decimal
#+end_src

** Análise descendente

- Processando um fator

#+begin_src haskell
pFactor :: Parser Exp
pFactor = choice [ Const <$> integer
                 , parens pExp
                 ]

#+end_src

** Análise descendente

- Para criar o parser de expressões, vamos usar a função =makeExprParser= que constrói o parser a partir de uma tabela de precedências.

** Análise descendente

- Definindo uma função para criar a precedência de um operador binário.
  - Pode-se definir operadores unários pré-fixados (=Prefix=) e pós-fixados (=Postfix=)

#+begin_src haskell
binary :: String -> (Exp -> Exp -> Exp) -> Operator Parser Exp
binary name f = InfixL (f <$ symbol name)
#+end_src

** Análise descendente

- Usando a função anterior, podemos criar a tabela de precedências.
  - Maiores precedências aparecem primeiro na tabela.

#+begin_src haskell
optable :: [[Operator Parser Exp]]
optable = [
            [binary "*" Mul]
          , [binary "+" Add]
          ]
#+end_src

** Análise descendente

- Parser de expressões

#+begin_src haskell
pExp :: Parser Exp
pExp = makeExprParser pFactor optable
#+end_src

** Análise descendente

- Podemos processar qualquer gramática usando analisadores descendentes?
  - Não: essa técnica aplica-se a gramáticas da classe LL(k).

** Análise descendente

- Gramáticas LL(k)
  - **L** : Entrada processada da esquerda para a direita
  - **L**: Produzindo uma derivação mais a esquerda
  - **k**: tomando a decisão usando até **k** tokens da entrada.

** Análise descendente

- Gramáticas LL(k)
  - Não possuem recursão à esquerda
  - Não possuem fatores comuns à esquerda
- De maneira geral, gramáticas LL(k) não possuem **ambiguidade**

