slides/aula03/aula03.tex
\subsection*{Transformação de gramáticas}
\label{sec:org97d2b75}

\begin{itemize}
\item Exemplo:
\begin{itemize}
\item Multiplicação com predência maior que adição.
\end{itemize}
\end{itemize}

\begin{array}{lcl}
E & \to & n \,|\,E + E\,|\,E * E\\
\end{array}
\subsection*{Transformação de gramáticas}
\label{sec:orgb0d561a}

\begin{itemize}
\item Exemplo
\end{itemize}

\begin{array}{lcl}
E_1 & \to & E_1 + E_2\,|\,E_2 \\
E_2 & \to & E_2 * E_3\,|\,E_3 \\
E_3 & \to & n\\
\end{array}
\subsection*{Transformações de gramáticas}
\label{sec:org53aa61b}

\begin{itemize}
\item Eliminar recursão à esquerda
\begin{itemize}
\item Transformar em recursão à direita.
\end{itemize}
\end{itemize}

\begin{array}{lcl}
A & \to & Ay_1\,|\,...\,|\,Ay_n\,|\,w_1\,|\,...\,|\,w_k\\
\end{array}
\subsection*{Transformações de gramáticas}
\label{sec:orgc6559dd}

\begin{itemize}
\item Pode ser transformada em
\end{itemize}

\begin{array}{lcl}
A & \to & w_1Z\,|\,...\,|\,w_kZ\,|\,w_1\,...\,|\,w_k\\
Z & \to & y_1Z\,|\,...\,|\,y_nZ\,|\,y_1\,...\,|\,y_n\\
\end{array}
\subsection*{Transformação de gramáticas}
\label{sec:org06da2b6}

\begin{itemize}
\item Eliminar recursão a esquerda.
\begin{itemize}
\item Resolução no quadro
\end{itemize}
\end{itemize}

\begin{array}{lcl}
   S & \to & Aa\,|\,b\\
   A & \to & Ac\,|\,Sd\,|\,\lambda\\
\end{array}
\section*{Árvores de sintaxe}
\label{sec:org3f83ce8}

\subsection*{Árvores de sintaxe}
\label{sec:orgb8bdec4}

\begin{itemize}
\item Em teoria de linguagens, representamos derivações de uma gramática por \textbf{\textbf{árvores de derivação}}.

\item Uma árvore de sintaxe deve representar a estrutura da derivação de um programa.
\end{itemize}
\subsection*{Árvores de sintaxe}
\label{sec:orgda63e33}

\begin{itemize}
\item Estratégia para definir árvores de sintaxe
\begin{itemize}
\item Um tipo para cada não terminal da gramática.
\item Cada regra de um não terminal, é um construtor do tipo.
\end{itemize}
\end{itemize}
\subsection*{Árvores de sintaxe}
\label{sec:orgdece0ed}

\begin{itemize}
\item Qual a estrutura da árvore de sintaxe:
\end{itemize}

\begin{array}{lcl}
E & \to & num \,|\,var\,|\,(E)\,|\,E+E\,|\,E * E\\
\end{array}
\subsection*{Árvores de sintaxe}
\label{sec:org73814e9}

\begin{itemize}
\item Árvore de sintaxe
\end{itemize}

\begin{verbatim}
data Exp = Const Int
         | Var String
         | Add Exp Exp
         | Mul Exp Exp
\end{verbatim}
\subsection*{Árvores de sintaxe}
\label{sec:orga583c67}

\begin{itemize}
\item Porque não uma construção para parêntesis?
\begin{itemize}
\item São usados apenas para determinar precedência
\item A rigor, parêntesis não tem significado após análise sintática.
\end{itemize}
\end{itemize}
\subsection*{Árvores de sintaxe}
\label{sec:orgebedecb}

\begin{itemize}
\item O tipo anterior é um exemplo de sintaxe \textbf{\textbf{abstrata}}
\begin{itemize}
\item Elimina detalhes irrelevantes para o significado do programa.
\end{itemize}
\item Código escrito do programa usa a sintaxe \textbf{\textbf{concreta}}.
\end{itemize}
\subsection*{Árvores de sintaxe}
\label{sec:org26be394}

\begin{itemize}
\item Considere a seguinte gramática:
\end{itemize}

\begin{array}{lcl}
S & \to & S\:S\:|\:s
\end{array}
\subsection*{Árvores de sintaxe}
\label{sec:org309e3d7}

\begin{itemize}
\item Representando a árvore de sintaxe
\end{itemize}

\begin{verbatim}
data S = Rule1 S S | Rule2 Char
\end{verbatim}
\subsection*{Árvores de sintaxe}
\label{sec:orgd522cc4}

\begin{itemize}
\item Considere a tarefa de produzir a string representada pela árvore
\end{itemize}

\begin{verbatim}
pprS :: S -> String
pprS (Rule1 s1 s2) = pprS s1 ++ pprS s2
pprS (Rule2 _) = "s"
\end{verbatim}
\subsection*{Árvores de sintaxe}
\label{sec:org226edba}

\begin{itemize}
\item Note que o construtor \texttt{Rule2 Char} não usa o caracter que armazena
\begin{itemize}
\item Sempre vamos produzir o caractere \texttt{s}.
\end{itemize}
\end{itemize}
\subsection*{Árvores de sintaxe}
\label{sec:org306864d}

\begin{itemize}
\item Podemos refinar a árvore para
\end{itemize}

\begin{verbatim}
data SA = Rule1 SA SA | Rule2
\end{verbatim}
\subsection*{Árvores de sintaxe}
\label{sec:orge5d9b8a}

\begin{itemize}
\item Refinando a função de impressão
\end{itemize}

\begin{verbatim}
pprS :: SA -> String
pprS (Rule1 s1 s2) = pprS s1 ++ pprS s2
pprS Rule2 = "s"
\end{verbatim}
\section*{Análise descendente}
\label{sec:orga40909b}

\subsection*{Análise descendente}
\label{sec:orgbd70ae8}

\begin{itemize}
\item Na apresentação do compilador de expressões, implementamos funções simples para um analisador descendente

\item Apesar de possuir uma implementação simples:
\begin{itemize}
\item Não é eficiente
\item Não permite uma maneira adequada para lidar com erros de análise sintática.
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org245683c}

\begin{itemize}
\item Vamos utilizar a biblioteca \texttt{megaparsec}
\begin{itemize}
\item Permite a construção de analisadores descendentes eficientes.
\item Bom suporte a mensagens de erro.
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org782ed52}

\begin{itemize}
\item Excelente documentação disponível on-line:
\end{itemize}

\url{https://markkarpov.com/tutorial/megaparsec.html}
\subsection*{Análise descendente}
\label{sec:orgeb89e10}

\begin{itemize}
\item Vamos apresentar a implementação do parser de expressões usando \texttt{megaparsec}

\item Exemplo disponível no módulo \texttt{Megaparsec.ParserExample} do repositório.
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org5035ef2}

\begin{itemize}
\item Primeiro passo: definir um tipo para os parsers e erros
\end{itemize}

\begin{verbatim}
type Parser = Parsec Void String

type ParserError = ParseErrorBundle String Void
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:orgdfb0065}

\begin{itemize}
\item Segundo passo: definir um analisador léxico.
\end{itemize}

\begin{verbatim}
slexer :: Parser ()
slexer = L.space space1
                 (L.skipLineComment "//")
                 (L.skipBlockComment "/*" "*/")
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:org5da10db}

\begin{itemize}
\item Definindo funções simples.
\end{itemize}

\begin{verbatim}
symbol :: String -> Parser String
symbol s = L.symbol slexer s
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:org0721a7a}

\begin{itemize}
\item Lidando com parêntesis
\end{itemize}

\begin{verbatim}
parens :: Parser a -> Parser a
parens = between (symbol "(") (symbol ")")
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:org444cd86}

\begin{itemize}
\item Adicionando a capacidade de eliminar espaços e comentários em um parser qualquer.
\end{itemize}

\begin{verbatim}
lexeme :: Parser a -> Parser a
lexeme = L.lexeme slexer
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:org792f05d}

\begin{itemize}
\item Processando números
\end{itemize}

\begin{verbatim}
integer :: Parser Int
integer = lexeme L.decimal
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:orga99f5ce}

\begin{itemize}
\item Processando um fator
\end{itemize}

\begin{verbatim}
pFactor :: Parser Exp
pFactor = choice [ Const <$> integer
                 , parens pExp
                 ]

\end{verbatim}
\subsection*{Análise descendente}
\label{sec:org145acc4}

\begin{itemize}
\item Para criar o parser de expressões, vamos usar a função \texttt{makeExprParser} que constrói o parser a partir de uma tabela de precedências.
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org6d5264b}

\begin{itemize}
\item Definindo uma função para criar a precedência de um operador binário.
\begin{itemize}
\item Pode-se definir operadores unários pré-fixados (\texttt{Prefix}) e pós-fixados (\texttt{Postfix})
\end{itemize}
\end{itemize}

\begin{verbatim}
binary :: String -> (Exp -> Exp -> Exp) -> Operator Parser Exp
binary name f = InfixL (f <$ symbol name)
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:orgdd8c884}

\begin{itemize}
\item Usando a função anterior, podemos criar a tabela de precedências.
\begin{itemize}
\item Maiores precedências aparecem primeiro na tabela.
\end{itemize}
\end{itemize}

\begin{verbatim}
optable :: [[Operator Parser Exp]]
optable = [
            [binary "*" Mul]
          , [binary "+" Add]
          ]
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:orgcad6fbe}

\begin{itemize}
\item Parser de expressões
\end{itemize}

\begin{verbatim}
pExp :: Parser Exp
pExp = makeExprParser pFactor optable
\end{verbatim}
\subsection*{Análise descendente}
\label{sec:org5c3ca01}

\begin{itemize}
\item Podemos processar qualquer gramática usando analisadores descendentes?
\begin{itemize}
\item Não: essa técnica aplica-se a gramáticas da classe LL(k).
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org95202c6}

\begin{itemize}
\item Gramáticas LL(k)
\begin{itemize}
\item \textbf{\textbf{L}} : Entrada processada da esquerda para a direita
\item \textbf{\textbf{L}}: Produzindo uma derivação mais a esquerda
\item \textbf{\textbf{k}}: tomando a decisão usando até \textbf{\textbf{k}} tokens da entrada.
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:orgb4e428d}

\begin{itemize}
\item Gramáticas LL(k)
\begin{itemize}
\item Não possuem recursão à esquerda
\item Não possuem fatores comuns à esquerda
\end{itemize}
\item De maneira geral, gramáticas LL(k) não possuem \textbf{\textbf{ambiguidade}}
\end{itemize}
