slides/aula03/aula03.org
** Análise descendente

- Então, para determinar se uma gramática é LL(k), basta determinar se ela é ou não ámbigua...

** Análise descendente

- Ambiguidade de gramáticas livres de contexto é um problema indecidível, no caso geral.
  - Pode-se reduzir o problema de correspondência de Post a ele.

** Análise descendente

- Vantagens:
  - Analisadores descendentes são eficientes, para $k = 1$.
  - Simples implementação.

** Análise descendente

- Desvantagens:
  - Não são capazes de lidar com gramáticas com regras recursivas à esquerda.
  - Regras não devem possuir fatores comuns à esquerda.

** Análise descendente

- Algum compilador usa essa técnica?
  - Analisador sintático de Lua e Go é descendente recursivo.
  - Analisador sintático de Clang é baseado nesta técnica.

* Conclusão

** Conclusão

- Nesta aula:
  - Importântica da análise sintática em um compilador.
  - Revisamos conceitos de gramáticas livres de contexto e transformações sobre estas.

** Conclusão

- Nesta aula:
  - Discutimos sobre sintaxe concreta e abstrata.
  - Mostramos como deduzir uma árvore de sintaxe a partir de uma gramática.

** Conclusão

- Nesta aula:
  - Apresentamos a técnica de análise descendente recursiva.
  - Usamos a biblioteca =megaparsec= para construção de um analisador descendente.
  - Discutimos vantagens e desvantagens de analisadores descendentes.

** Conclusão

- Próxima aula:

  - Análise sintática preditiva LL(1).
