slides/aula03/aula03.tex
\subsection*{Análise descendente}
\label{sec:org95324ed}

\begin{itemize}
\item Então, para determinar se uma gramática é LL(k), basta determinar se ela é ou não ámbigua\ldots{}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org75d977c}

\begin{itemize}
\item Ambiguidade de gramáticas livres de contexto é um problema indecidível, no caso geral.
\begin{itemize}
\item Pode-se reduzir o problema de correspondência de Post a ele.
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org8c60347}

\begin{itemize}
\item Vantagens:
\begin{itemize}
\item Analisadores descendentes são eficientes, para \(k = 1\).
\item Simples implementação.
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:orge388de2}

\begin{itemize}
\item Desvantagens:
\begin{itemize}
\item Não são capazes de lidar com gramáticas com regras recursivas à esquerda.
\item Regras não devem possuir fatores comuns à esquerda.
\end{itemize}
\end{itemize}
\subsection*{Análise descendente}
\label{sec:org22484bb}

\begin{itemize}
\item Algum compilador usa essa técnica?
\begin{itemize}
\item Analisador sintático de Lua e Go é descendente recursivo.
\item Analisador sintático de Clang é baseado nesta técnica.
\end{itemize}
\end{itemize}
\section*{Conclusão}
\label{sec:orgc3a6306}

\subsection*{Conclusão}
\label{sec:org0692806}

\begin{itemize}
\item Nesta aula:
\begin{itemize}
\item Importântica da análise sintática em um compilador.
\item Revisamos conceitos de gramáticas livres de contexto e transformações sobre estas.
\end{itemize}
\end{itemize}
\subsection*{Conclusão}
\label{sec:org5eb49da}

\begin{itemize}
\item Nesta aula:
\begin{itemize}
\item Discutimos sobre sintaxe concreta e abstrata.
\item Mostramos como deduzir uma árvore de sintaxe a partir de uma gramática.
\end{itemize}
\end{itemize}
\subsection*{Conclusão}
\label{sec:org6f6d473}

\begin{itemize}
\item Nesta aula:
\begin{itemize}
\item Apresentamos a técnica de análise descendente recursiva.
\item Usamos a biblioteca \texttt{megaparsec} para construção de um analisador descendente.
\item Discutimos vantagens e desvantagens de analisadores descendentes.
\end{itemize}
\end{itemize}
\subsection*{Conclusão}
\label{sec:orgd7cf339}

\begin{itemize}
\item Próxima aula:

\begin{itemize}
\item Análise sintática preditiva LL(1).
\end{itemize}
\end{itemize}
\end{document}
